{"pageProps":{"blog":{"content":"\n\nWith so many different programming languages and technologies available today, it can sometimes be confusing on which to choose for a new project. If I were given the choice, these are my top 4 favourite languages that I would use. \n\n\n\n# 4 Python\nI really like the syntax of python. The fact that it is indentation based and I don't have to deal with brackets makes the code look nice.\n\n\n# 3  PHP\nPHP is the kind of language which gets things done. I have always been interested in web development, and since PHP focuses almost exclusively on web development, I use it sometimes.\n\n\n# 2  Javascript\nAbove PHP, javascript is truly the language of the web. It is the only language to write  a full-stack application because it works on the front end and the back end.  From React to Node.js, there are many libraries, tools, and frameworks for Javascript. The extraordinary tooling makes it possible to do anything in javascript, and one will never have to switch languages if one chooses it.\n\n\n# 1  Haskell\nHaskell is my all time favourite language. It is type-safe and entirely functional. By learning Haskell, I have changed the way I think about programming. Haskell forces the programmer to learn about types and side effects in a way which no other language does. I will always try to use Haskell if I can in any context.\n","date":"April 12, 2021","tags":["python"," PHP"," javascript"," go"," java"," haskell"],"title":"My favourite Programming languages","slug":"fav-lang","description":"Programming languages are like tools, so you need the right tool for the job","image":"/images/php.png"},"reccomendedBlog":[{"content":"\n\n# What is Undecidability\n\nLike Icarus flying too close to the sun it seems that every mathematical system\nwill eventually be drawn towards the black hole of undecidability. Decidability\nbasically means there is an algorithm to answer a question. [Adding Numbers](https://lisbdnet.com/what-is-standard-algorithm-addition/#:~:text=standard%20algorithm%20addition%3F-,The%20standard%20algorithm%20for%20addition%20has%20three%20simple%20rules%3A,3%3A%20Regroup%2C%20if%20necessary) is decidable but [finding the shortest path](https://en.wikipedia.org/wiki/Travelling_salesman_problem) is not. In general I have noticed a pattern in\nall systems of rules. The system starts off simple. Then, as more use cases pile up, more\nrules and properties are added until suddenly, the system is undecidable. What happend here?\nI will start with a few examples\n\n# Typing Systems for Programming Languages\n\nI first encountered this problem in the type system of programming languages, or basically\nan algorithm that says `5` is an integer or `[1,2,3]` is a list of integers. You may think this problem is easy, and indeed the way I have just phrased it is decidable by [Algorithm W](https://en.wikipedia.org/wiki/Hindley%E2%80%93Milner_type_system#Algorithm_W). A type system is very useful,\nbut people have encountered corner cases, such as depenedent types or linear types, and they\ntry to extend the type system. For example, if you are trying to figure out the type of \n[C](https://en.wikipedia.org/wiki/The_C_Programming_Language)'s [printf](https://en.wikipedia.org/wiki/Printf_format_string), you might realise that the type of the second\nargument depends on the type of the first argument.\n\n```c\nprintf(\"%f %s\", 1.2, \"hello\")\n```\nIf you want to encode this information into the type system, then you have just discovered\ndependent types, where types depend on values. The problem of finding out if a dependently\ntyped program is valid is actually undecidable (as a subset of the [halting problem](https://en.wikipedia.org/wiki/Halting_problem)). One you say you want this, you have stepped out\nof the safety of decidable typing and you might now need to prove to the compiler\nusing a formal proof that a program typchecks, such as in languages such as [Idris](https://www.idris-lang.org/). A good documentation of this problem is on the website [typing is hard](https://3fx.ch/typing-is-hard.html).\n\nIn my view, the ideal type system of a programming language should be decidable. I don't want\nto have to write a proof that my progam is valid. The best type system for this is [Hindley-Milner](https://en.wikipedia.org/wiki/Hindley%E2%80%93Milner_type_system) which is about as far as you can creep before you plumet off the cliff of undeciability.\n\n# Presbuger Arithmetic\n\nAnother beautiful example of walking the tightrope of decidability is [Presburger Arithmetic](https://en.wikipedia.org/wiki/Presburger_arithmetic). Surprisingly, it is a formulation of arithmetic\nwhere every statement is decidable by a simple algorithm. For example, you can say \n`x+y > 10` and the Presburger algorithm will find all satisfying x and y. What is the catch?\nThere is no multiplication. Presbuger Arithmetic only has plus, equals, there exists, and for all.\nSo statements about prime factorization, for example, are impossible to state in Presburger Arithmetic. It seems that multiplcation is intricately linked with undecidability. And\nOnce we say we want multiplication, arithmetic no longer becomes decidable.\n\n# Undecidability is Interesting\n\nUnlike programmers, who would want decidabilty type systems, we mathematicians do **not**\nwant decidability in our systems. In truth, decidable systems are boring, and pose no\ninteresting mathematical questions. Due to the well-established relationship between\nexpressiveness and decidability, once we make a system expressive enough to pose\ninteresting questions, it becomes undecidable. Furthermore, in decidable systems,\ntruth is simply a matter of computation. If you want to check if a statement is \ntrue, just run a computer to check it. Mathematics in decidable systems loses\nall its beauty and elegance of unconventional proofs.  So maybe undeciability isn't so bad.\n\n# Walking off the Cliff\n\nWhat can you take away from this? Well let's say you're designing a programming tool like\na configuration language or a macro system. Users might demand more and more features, until,\nunwittingly, your simple little tool becomes undecidable. This happened to C++ templates,\nwhere now they are [turing complete](https://stackoverflow.com/questions/189172/c-templates-turing-complete) (or in other words undecidable). So my advice is to\nkeep in mind the original goal of your project and be aware of any features that\nmight cause you to wander from the island of safety that is decidability. \n\n\n","date":"April 7, 2022","tags":["automata"," decidability"," presbuger arithmetic"," type system"],"title":"The Decidability Tradeoff","slug":"decidability-tradeoff","description":"There is a fine line between power and decidability","image":"/images/automata.jpeg"},{"content":"\n\n\n# Boolean Considered Harmful\n\nI make the claim that using the boolean type (called \"Boolean\")\nis always a bad design decesion. This is because `Boolean` is\nlike the rind of an orange that has been squeezed out. The rind\ntestifies that there once was an orange here, but the juicy goodness\nof the orange is long gone.\n\nIt is the same with `Boolean`. If you are using `Boolean`, there was\nonce a function which returned more information, but this helpful information\nwas thrown away when all the information was squashed down into only 2 states.\n\nMy recommendation is that for any time you are tempted to write \"Boolean\", consider\nwhat information the function is actually computing.\n\nTo illustrate my point more, I will code the equality function on natural numbers in\n[Agda](https://en.wikipedia.org/wiki/Agda_(programming_language)). For any natural numbers `x` and `y`, `x == y` returns `true` if `x` is equal\nto `y` and false otherwise. I will then contrast this function against `x ==? y`, which I claim\nis a better function.\n\nDo not worry if you do not know [Agda](https://en.wikipedia.org/wiki/Agda_(programming_language)), because\nI will be explaining the code at every step.\n\n\n# Standard Library Functions\n\nFirst, I will defining some standard functions.\nThese functions are all in the [standard library of Agda](https://agda.github.io/agda-stdlib/),\nso this section is a learning exercise where I will be thouroughly explaining the purpose of all\nthe code.\n\n## Peano Numbers\n\nWe will represent natural numbers as [Peano Numbers](https://en.wikipedia.org/wiki/Peano_axioms), which means\nthat every natural number is either `0` or `successor(n)` for some natural number `n`. In Agda, we would\nrepresent the natural numbers as this data type:\n\n```agda\ndata NaturalNumber : Set where\n  zero : NaturalNumber\n  successor : NaturalNumber → NaturalNumber\nvariable\n  m n : NaturalNumber\n```\n## Booleans\n\nWe can then define the much-dreaded `Boolean`, which is either `true` or `false`.\n\n```agda\ndata Boolean : Set where\n  true : Boolean\n  false : Boolean\n```\n## Booleanean (Bad) Equality\n\nIn our first attempt to define equality on natural numbers, we use a `Boolean` to represent the result:\n`true` if the two numbers are equal and `false` if the two numbers are not equal.\n\n```agda\ninfixr 5 _==_\n_==_ : NaturalNumber → NaturalNumber → Boolean\nzero == zero = true\nsuccessor a == zero = false\nzero == successor b = false\nsuccessor a == successor b = a == b\n```\n\n## Propositional Equality\n\nTo begin to define our better equality, we first need a specification of equality.\nSome beginners are confused by propositional equality because propositional equality\ndoes not *compute* if two values are equal, but rather it gives the type of all *proofs*\nthat they are equal.\n\n```agda\ninfixr 5 _≡_\ndata _≡_  {A : Set o} :  A → A →  Set (lsuc o) where\n  reflexivity : {a : A} →  a ≡ a\n```\n\nSo, for example, `a ≡ b` is the type of all proofs that `a` is equal to `b`.\n\n## Empty Type\n\nThe empty type is inhabited by no values. The empty type represents the false proposition, or the proposition\nwith no proofs.\n\n```agda\ndata empty : Set where\n```\n\n## Decidability\n\nWith these pieces, we can define `decidability`. A proposition\nis [decidable](https://en.wikipedia.org/wiki/Decidability_(logic)) if there exists an\nalgorithm for deciding if the proposition is inhabited.\nThe `decides A` type will either produce evidence that `A` is inhabited, or\nproduce evidence that `A` in uninhabited.\n\n```agda\ndata decides (A : Set o) : Set o where\n  trueBecauseOf : A → decides A\n  falseBecauseOf : (A → empty) → decides A\n```\n\nA simple utility function which proves that `successor` is\nan [injective function](https://en.wikipedia.org/wiki/Injective_function).\n\n```agda\nsuccessorInjective : successor m ≡ successor n → m ≡ n\nsuccessorInjective reflexivity = reflexivity\n```\n\nGiven the type `decides`, we can say what it means for a [binary function](https://en.wikipedia.org/wiki/Binary_operation)\nto be decidable: for all its inputs, we can produce evidence of the type\nbeing inhabited or uninhabited.\n\n```agda\ndecidable2 : {A B : Set o} →  (A → B → Set ℓ) → Set (o ⊔ ℓ)\ndecidable2 {A = A} {B = B} f = (a : A) (b : B) → decides (f a b)\n```\n\n# The Improved Natural Number Equality\n\nWe will now define the improved equality function on natural numbers:\n\n```agda\ninfixr 5 _==?_\n_==?_ : decidable2 {A = NaturalNumber}  (_≡_)\nzero ==? zero = trueBecauseOf reflexivity\nzero ==? successor y = falseBecauseOf λ ()\nsuccessor x ==? zero = falseBecauseOf λ ()\nsuccessor x ==? successor y with (x ==? y)\n... | trueBecauseOf reflexivity = trueBecauseOf reflexivity\n... | falseBecauseOf x≢y = falseBecauseOf  (λ z → x≢y (successorInjective z))\n```\n\n# Why the Deciding Verison is Better\n\nYou might be wondering: \"why is `x ==? y` better than `x == y`\". In short, it is because\n`x ==? y` has a specification, but `x == y` does not.\n\nWhat's more, for all inputs, `x ==? y` returns evidence that it is correct, whereas we have not even\nstated the correctness specification for `x == y`.\n\nYou should always assume that everything is wrong until you have a formal proof that it is correct.\n\nAny function with the type signature `decidable2 {A = NaturalNumber}  (_≡_)` *must* be correct. By\nusing a more expressive type, we have ensured correctness automatically.  Others have said\n[\"make illegal states unrepresentable\"](https://fsharpforfunandprofit.com/posts/designing-with-types-making-illegal-states-unrepresentable/)\nbut I say, \"make incorrect code unwritable\".\nWrite a specification so that the only option is for your code to be correct.\n\nWith the pedestrian `x == y`, it would be easy to write a function with the same type signature that,\nin fact, would be incorrect.\n\nThe main concern in software is proofs of correctness. Every other aspect of code (including performance)\nis secondary. To learn more about this, look at [this talk](https://github.com/conal/talk-2023-galilean-revolution).\n\nFor these reasons, I strongly advise that 90% of the use of `Boolean`s is incorrect, and could be\nreplaced by more informative types.\n","date":"August 23, 2023","tags":["boolean"," denotational design"," correctness"],"title":"Boolean Considered Harmful","slug":"boolHarmful","description":"Most uses of Boolean are wrong","image":"/images/babBools.png"},{"content":"\n\nComplex analysis might just be my favorite field of mathematics. It is a field steeped in\nelegance, and it makes it apparent that calculus was always supposed to be done on the complex numbers. \n\n\nYou must be stupid to think that real analysis is better than complex\nanalysis. In real analysis, functions can be not differentiable, but in complex analysis,\nif a function is once-differentiable, it is infinitely differentiable. Also, if you know\na complex function on an interval, you know it for all numbers.\n\nContour integral\n\n\n\n\n\n\n\n","date":"Jan 20, 2022","tags":["complex analysis"," math"," calculus"],"title":"Complex Analysis is Super Cool","slug":"complex-analysis","description":"it's my favorite field of mathematics","image":"/images/complex-analysis.png"}]},"__N_SSG":true}