{"pageProps":{"blog":{"content":"\nBecause I program in haskell, I have a lot of experience with monads, and now I see monads wherever I go. Monads are truly everywhere. Many people have already interacted with monads without even realising it. In fact, Javascript's promise is a monad. Despite this, the first result on google search for \"is promise a monad\", is titled, \"no, promise is not a monad\". I see this blog post as a response to that article. In this post by Buzz De Cafe, the author claims that javascript's promise is not a monad because it does not follow the mathematical laws of monads. However, nobody in haskell actually uses moands in the mathematical sense. It doesn't really matter if Promise is a mathematical monad, what really matters is if it acts like a programming monad, which it does. For example, let's take the haskell function \n\n```haskell\n\nsequence :: (Traversable t, Monad m) => t (m a) -> m (t a)\n\n```\nWhen I saw this, I was struck by how similar it is to Javascript's\n\n```haskell\nPromise.all ::[promise a] -> promise [a]\n```\nI have written the type signature of Javascript's Promise.all in haskell syntax to lay apparent how similar these two functions are. Also let us look at .then vs >>=\n\n\n```haskell,\n\n (>>=) :: Monad m => m a -> (a -> m b) -> m b\n```\n\n```javascript\n\nfetch(url)\n\t.then(data=> data.json())\n```\nBoth haskell's bind operator >>= and javascript .then extract the internal value of a monad. And let me remind the reader, that >>= is the minimal operator for the monad typeclass in haskell, so if promise were defined in haskell, all one would have to do is\n\n```haskell\ninstance Monad Promise where\n     (>>=) = (then)\n```\n\nIt is obvious that Promise has all the characteristics of a Monad, so when haskellers complain that it does not obey some mathematical law, those are just sprinklings on top of a monad that don't really affect its functionality.  \n\nSome people may knock Javascript for not being as intellectual or high level as Haskell, but in fact it has almost all of the same structures, just with not as mathematical names. The example of Javascript's Promise being a monad shows that it is truly a high level language. \n\n\n\n","date":"April 12, 2021","tags":["haskell"],"title":"Why promise IS a monad","slug":"promise-is-a-monad","description":"There are monads all around us, even if we don't notice it","image":"/images/monad.jpg"},"reccomendedBlog":[{"content":"\nIn recent years, we've seen a lot of hype around machine learning. From [alpha go](https://deepmind.com/research/case-studies/alphago-the-story-so-far), which beat world-champion go\nplayers, to","date":"January 27, 2022","tags":["machine learning"," ml"," AI"],"title":"Machine Learning is overrated","slug":"machine-learning-overrated","description":"I don't understand the hype around machine learning","image":"/images/Blog-Images-Forget-Machine-Learning-Humans-Still-Have-a-Lot-to-Learn-Part-II.jpg"},{"content":"\n\nComplex analysis might just be my favorite field of mathematics. It is a field steeped in\nelegance, and it makes it apparent that calculus was always supposed to be done on the complex numbers. \n\n\nYou must be stupid to think that real analysis is better than complex\nanalysis. In real analysis, functions can be not differentiable, but in complex analysis,\nif a function is once-differentiable, it is infinitely differentiable. Also, if you know\na complex function on an interval, you know it for all numbers.\n\nContour integral\n\n\n\n\n\n\n\n","date":"Jan 20, 2022","tags":["complex analysis"," math"," calculus"],"title":"Complex Analysis is Super Cool","slug":"complex-analysis","description":"it's my favorite field of mathematics","image":"/images/complex-analysis.png"},{"content":"\nI have written this blog post to commemorate how my site has started today. I am especially excited as to how it turned out and I always wanted to make a personal site for myself to display my projects. I built this site using next JS and posting it on GitHub pages.I hope you take the time to look at my blog posts and projects which are on this site \n","date":"April 5, 2021","tags":["blog"," javascript"," github"],"title":"The Start of My Blog","slug":"start","description":"my first blog","image":"/images/start.jpg"}]},"__N_SSG":true}