{"pageProps":{"blog":{"content":"\n\nThe text editor VIM is possibly one of my favourite tools for developing and coding. Whenever I have the opportunity to use vim, from VS code to Overleaf, and even google docs, I take it. I just want more people to learn and use VIM because of what an enjoyable tool is\n\n# Macros\nMany people often waste time slaving away at menial and boring text editing tasks. Vim makes relative tasks and actions easy using macros, or repeatable sets of keystrokes. \n\n\n# Speed\nIt's no doubt that with all the keybindings, getting from one location in the text to another is usually only a few keypresses. Typing is far faster than using a mouse. I have no doubt that my coding speed has increased twofold due to Vim.\n\n\n# Efficiency\nOften when I realise I have not completed the most keystroke efficient algorithm in VIM, I undo all my changes to try again. There is something immensely satisfying about executing the proper algorithm in VIM which I strive for every time I code. \n","date":"April 12, 2021","tags":["vim"],"title":"Why I love VIM","slug":"why-i-love-vim","description":"Vim is arguable the best text editor","image":"/images/vim.png"},"reccomendedBlog":[{"content":"\n\n\n# Boolean Considered Harmful\n\nI make the claim that using the boolean type (called \"Boolean\")\nis always a bad design decesion. This is because `Boolean` is\nlike the rind of an orange that has been squeezed out. The rind\ntestifies that there once was an orange here, but the juicy goodness\nof the orange is long gone.\n\nIt is the same with `Boolean`. If you are using `Boolean`, there was\nonce a function which returned more information, but this helpful information\nwas thrown away when all the information was squashed down into only 2 states.\n\nMy recommendation is that for any time you are tempted to write \"Boolean\", consider\nwhat information the function is actually computing.\n\nTo illustrate my point more, I will code the equality function on natural numbers in\n[Agda](https://en.wikipedia.org/wiki/Agda_(programming_language)). For any natural numbers `x` and `y`, `x == y` returns `true` if `x` is equal\nto `y` and false otherwise. I will then contrast this function against `x ==? y`, which I claim\nis a better function.\n\nDo not worry if you do not know [Agda](https://en.wikipedia.org/wiki/Agda_(programming_language)), because\nI will be explaining the code at every step.\n\n\n# Standard Library Functions\n\nFirst, I will defining some standard functions.\nThese functions are all in the [standard library of Agda](https://agda.github.io/agda-stdlib/),\nso this section is a learning exercise where I will be thouroughly explaining the purpose of all\nthe code.\n\n## Peano Numbers\n\nWe will represent natural numbers as [Peano Numbers](https://en.wikipedia.org/wiki/Peano_axioms), which means\nthat every natural number is either `0` or `successor(n)` for some natural number `n`. In Agda, we would\nrepresent the natural numbers as this data type:\n\n```agda\ndata NaturalNumber : Set where\n  zero : NaturalNumber\n  successor : NaturalNumber → NaturalNumber\nvariable\n  m n : NaturalNumber\n```\n## Booleans\n\nWe can then define the much-dreaded `Boolean`, which is either `true` or `false`.\n\n```agda\ndata Boolean : Set where\n  true : Boolean\n  false : Boolean\n```\n## Booleanean (Bad) Equality\n\nIn our first attempt to define equality on natural numbers, we use a `Boolean` to represent the result:\n`true` if the two numbers are equal and `false` if the two numbers are not equal.\n\n```agda\ninfixr 5 _==_\n_==_ : NaturalNumber → NaturalNumber → Boolean\nzero == zero = true\nsuccessor a == zero = false\nzero == successor b = false\nsuccessor a == successor b = a == b\n```\n\n## Propositional Equality\n\nTo begin to define our better equality, we first need a specification of equality.\nSome beginners are confused by propositional equality because propositional equality\ndoes not *compute* if two values are equal, but rather it gives the type of all *proofs*\nthat they are equal.\n\n```agda\ninfixr 5 _≡_\ndata _≡_  {A : Set o} :  A → A →  Set (lsuc o) where\n  reflexivity : {a : A} →  a ≡ a\n```\n\nSo, for example, `a ≡ b` is the type of all proofs that `a` is equal to `b`.\n\n## Empty Type\n\nThe empty type is inhabited by no values. The empty type represents the false proposition, or the proposition\nwith no proofs.\n\n```agda\ndata empty : Set where\n```\n\n## Decidability\n\nWith these pieces, we can define `decidability`. A proposition\nis [decidable](https://en.wikipedia.org/wiki/Decidability_(logic)) if there exists an\nalgorithm for deciding if the proposition is inhabited.\nThe `decides A` type will either produce evidence that `A` is inhabited, or\nproduce evidence that `A` in uninhabited.\n\n```agda\ndata decides (A : Set o) : Set o where\n  trueBecauseOf : A → decides A\n  falseBecauseOf : (A → empty) → decides A\n```\n\nA simple utility function which proves that `successor` is\nan [injective function](https://en.wikipedia.org/wiki/Injective_function).\n\n```agda\nsuccessorInjective : successor m ≡ successor n → m ≡ n\nsuccessorInjective reflexivity = reflexivity\n```\n\nGiven the type `decides`, we can say what it means for a [binary function](https://en.wikipedia.org/wiki/Binary_operation)\nto be decidable: for all its inputs, we can produce evidence of the type\nbeing inhabited or uninhabited.\n\n```agda\ndecidable2 : {A B : Set o} →  (A → B → Set ℓ) → Set (o ⊔ ℓ)\ndecidable2 {A = A} {B = B} f = (a : A) (b : B) → decides (f a b)\n```\n\n# The Improved Natural Number Equality\n\nWe will now define the improved equality function on natural numbers:\n\n```agda\ninfixr 5 _==?_\n_==?_ : decidable2 {A = NaturalNumber}  (_≡_)\nzero ==? zero = trueBecauseOf reflexivity\nzero ==? successor y = falseBecauseOf λ ()\nsuccessor x ==? zero = falseBecauseOf λ ()\nsuccessor x ==? successor y with (x ==? y)\n... | trueBecauseOf reflexivity = trueBecauseOf reflexivity\n... | falseBecauseOf x≢y = falseBecauseOf  (λ z → x≢y (successorInjective z))\n```\n\n# Why the Deciding Verison is Better\n\nYou might be wondering: \"why is `x ==? y` better than `x == y`\". In short, it is because\n`x ==? y` has a specification, but `x == y` does not.\n\nWhat's more, for all inputs, `x ==? y` returns evidence that it is correct, whereas we have not even\nstated the correctness specification for `x == y`.\n\nYou should always assume that everything is wrong until you have a formal proof that it is correct.\n\nAny function with the type signature `decidable2 {A = NaturalNumber}  (_≡_)` *must* be correct. By\nusing a more expressive type, we have ensured correctness automatically.  Others have said\n[\"make illegal states unrepresentable\"](https://fsharpforfunandprofit.com/posts/designing-with-types-making-illegal-states-unrepresentable/)\nbut I say, \"make incorrect code unwritable\".\nWrite a specification so that the only option is for your code to be correct.\n\nWith the pedestrian `x == y`, it would be easy to write a function with the same type signature that,\nin fact, would be incorrect.\n\nThe main concern in software is proofs of correctness. Every other aspect of code (including performance)\nis secondary. To learn more about this, look at [this talk](https://github.com/conal/talk-2023-galilean-revolution).\n\nFor these reasons, I strongly advise that 90% of the use of `Boolean`s is incorrect, and could be\nreplaced by more informative types.\n","date":"August 23, 2023","tags":["boolean"," denotational design"," correctness"],"title":"Boolean Considered Harmful","slug":"boolHarmful","description":"Most uses of Boolean are wrong","image":"/images/babBools.png"},{"content":"\n\nComplex analysis might just be my favorite field of mathematics. It is a field steeped in\nelegance, and it makes it apparent that calculus was always supposed to be done on the complex numbers. \n\n\nYou must be stupid to think that real analysis is better than complex\nanalysis. In real analysis, functions can be not differentiable, but in complex analysis,\nif a function is once-differentiable, it is infinitely differentiable. Also, if you know\na complex function on an interval, you know it for all numbers.\n\nContour integral\n\n\n\n\n\n\n\n","date":"Jan 20, 2022","tags":["complex analysis"," math"," calculus"],"title":"Complex Analysis is Super Cool","slug":"complex-analysis","description":"it's my favorite field of mathematics","image":"/images/complex-analysis.png"},{"content":"\nBecause I program in haskell, I have a lot of experience with monads, and now I see monads wherever I go. Monads are truly everywhere. Many people have already interacted with monads without even realising it. In fact, Javascript's promise is a monad. Despite this, the first result on google search for \"is promise a monad\", is titled, \"no, promise is not a monad\". I see this blog post as a response to that article. In this post by Buzz De Cafe, the author claims that javascript's promise is not a monad because it does not follow the mathematical laws of monads. However, nobody in haskell actually uses moands in the mathematical sense. It doesn't really matter if Promise is a mathematical monad, what really matters is if it acts like a programming monad, which it does. For example, let's take the haskell function \n\n```haskell\n\nsequence :: (Traversable t, Monad m) => t (m a) -> m (t a)\n\n```\nWhen I saw this, I was struck by how similar it is to Javascript's\n\n```haskell\nPromise.all ::[promise a] -> promise [a]\n```\nI have written the type signature of Javascript's Promise.all in haskell syntax to lay apparent how similar these two functions are. Also let us look at .then vs >>=\n\n\n```haskell,\n\n (>>=) :: Monad m => m a -> (a -> m b) -> m b\n```\n\n```javascript\n\nfetch(url)\n\t.then(data=> data.json())\n```\nBoth haskell's bind operator >>= and javascript .then extract the internal value of a monad. And let me remind the reader, that >>= is the minimal operator for the monad typeclass in haskell, so if promise were defined in haskell, all one would have to do is\n\n```haskell\ninstance Monad Promise where\n     (>>=) = (then)\n```\n\nIt is obvious that Promise has all the characteristics of a Monad, so when haskellers complain that it does not obey some mathematical law, those are just sprinklings on top of a monad that don't really affect its functionality.  \n\nSome people may knock Javascript for not being as intellectual or high level as Haskell, but in fact it has almost all of the same structures, just with not as mathematical names. The example of Javascript's Promise being a monad shows that it is truly a high level language. \n\n\n\n","date":"April 12, 2021","tags":["haskell"],"title":"Why promise IS a monad","slug":"promise-is-a-monad","description":"There are monads all around us, even if we don't notice it","image":"/images/monad.jpg"}]},"__N_SSG":true}