{"pageProps":{"blog":{"content":"\n\nComplex analysis might just be my favorite field of mathematics. It is a field steeped in\nelegance, and it makes it apparent that calculus was always supposed to be done on the complex numbers. \n\n\nYou must be stupid to think that real analysis is better than complex\nanalysis. In real analysis, functions can be not differentiable, but in complex analysis,\nif a function is once-differentiable, it is infinitely differentiable. Also, if you know\na complex function on an interval, you know it for all numbers.\n\nContour integral\n\n\n\n\n\n\n\n","date":"Jan 20, 2022","tags":["complex analysis"," math"," calculus"],"title":"Complex Analysis is Super Cool","slug":"complex-analysis","description":"it's my favorite field of mathematics","image":"/images/complex-analysis.png"},"reccomendedBlog":[{"content":"\nBecause I program in haskell, I have a lot of experience with monads, and now I see monads wherever I go. Monads are truly everywhere. Many people have already interacted with monads without even realising it. In fact, Javascript's promise is a monad. Despite this, the first result on google search for \"is promise a monad\", is titled, \"no, promise is not a monad\". I see this blog post as a response to that article. In this post by Buzz De Cafe, the author claims that javascript's promise is not a monad because it does not follow the mathematical laws of monads. However, nobody in haskell actually uses moands in the mathematical sense. It doesn't really matter if Promise is a mathematical monad, what really matters is if it acts like a programming monad, which it does. For example, let's take the haskell function \n\n```haskell\n\nsequence :: (Traversable t, Monad m) => t (m a) -> m (t a)\n\n```\nWhen I saw this, I was struck by how similar it is to Javascript's\n\n```haskell\nPromise.all ::[promise a] -> promise [a]\n```\nI have written the type signature of Javascript's Promise.all in haskell syntax to lay apparent how similar these two functions are. Also let us look at .then vs >>=\n\n\n```haskell,\n\n (>>=) :: Monad m => m a -> (a -> m b) -> m b\n```\n\n```javascript\n\nfetch(url)\n\t.then(data=> data.json())\n```\nBoth haskell's bind operator >>= and javascript .then extract the internal value of a monad. And let me remind the reader, that >>= is the minimal operator for the monad typeclass in haskell, so if promise were defined in haskell, all one would have to do is\n\n```haskell\ninstance Monad Promise where\n     (>>=) = (then)\n```\n\nIt is obvious that Promise has all the characteristics of a Monad, so when haskellers complain that it does not obey some mathematical law, those are just sprinklings on top of a monad that don't really affect its functionality.  \n\nSome people may knock Javascript for not being as intellectual or high level as Haskell, but in fact it has almost all of the same structures, just with not as mathematical names. The example of Javascript's Promise being a monad shows that it is truly a high level language. \n\n\n\n","date":"April 12, 2021","tags":["haskell"],"title":"Why promise IS a monad","slug":"promise-is-a-monad","description":"There are monads all around us, even if we don't notice it","image":"/images/monad.jpg"},{"content":"\n\nWith so many different programming languages and technologies available today, it can sometimes be confusing on which to choose for a new project. If I were given the choice, these are my top 4 favourite languages that I would use. \n\n\n\n# 4 Python\nI really like the syntax of python. The fact that it is indentation based and I don't have to deal with brackets makes the code look nice.\n\n\n# 3  PHP\nPHP is the kind of language which gets things done. I have always been interested in web development, and since PHP focuses almost exclusively on web development, I use it sometimes.\n\n\n# 2  Javascript\nAbove PHP, javascript is truly the language of the web. It is the only language to write  a full-stack application because it works on the front end and the back end.  From React to Node.js, there are many libraries, tools, and frameworks for Javascript. The extraordinary tooling makes it possible to do anything in javascript, and one will never have to switch languages if one chooses it.\n\n\n# 1  Haskell\nHaskell is my all time favourite language. It is type-safe and entirely functional. By learning Haskell, I have changed the way I think about programming. Haskell forces the programmer to learn about types and side effects in a way which no other language does. I will always try to use Haskell if I can in any context.\n","date":"April 12, 2021","tags":["python"," PHP"," javascript"," go"," java"," haskell"],"title":"My favourite Programming languages","slug":"fav-lang","description":"Programming languages are like tools, so you need the right tool for the job","image":"/images/php.png"},{"content":"\n\nThe text editor VIM is possibly one of my favourite tools for developing and coding. Whenever I have the opportunity to use vim, from VS code to Overleaf, and even google docs, I take it. I just want more people to learn and use VIM because of what an enjoyable tool is\n\n# Macros\nMany people often waste time slaving away at menial and boring text editing tasks. Vim makes relative tasks and actions easy using macros, or repeatable sets of keystrokes. \n\n\n# Speed\nIt's no doubt that with all the keybindings, getting from one location in the text to another is usually only a few keypresses. Typing is far faster than using a mouse. I have no doubt that my coding speed has increased twofold due to Vim.\n\n\n# Efficiency\nOften when I realise I have not completed the most keystroke efficient algorithm in VIM, I undo all my changes to try again. There is something immensely satisfying about executing the proper algorithm in VIM which I strive for every time I code. \n","date":"April 12, 2021","tags":["vim"],"title":"Why I love VIM","slug":"why-i-love-vim","description":"Vim is arguable the best text editor","image":"/images/vim.png"}]},"__N_SSG":true}