{"pageProps":{"blog":{"content":"\n\n# What is Undecidability\n\nLike Icarus flying too close to the sun it seems that every mathematical system\nwill eventually be drawn towards the black hole of undecidability. Decidability\nbasically means there is an algorithm to answer a question. [Adding Numbers](https://lisbdnet.com/what-is-standard-algorithm-addition/#:~:text=standard%20algorithm%20addition%3F-,The%20standard%20algorithm%20for%20addition%20has%20three%20simple%20rules%3A,3%3A%20Regroup%2C%20if%20necessary) is decidable but [finding the shortest path](https://en.wikipedia.org/wiki/Travelling_salesman_problem) is not. In general I have noticed a pattern in\nall systems of rules. The system starts off simple. Then, as more use cases pile up, more\nrules and properties are added until suddenly, the system is undecidable. What happend here?\nI will start with a few examples\n\n# Typing Systems for Programming Languages\n\nI first encountered this problem in the type system of programming languages, or basically\nan algorithm that says `5` is an integer or `[1,2,3]` is a list of integers. You may think this problem is easy, and indeed the way I have just phrased it is decidable by [Algorithm W](https://en.wikipedia.org/wiki/Hindley%E2%80%93Milner_type_system#Algorithm_W). A type system is very useful,\nbut people have encountered corner cases, such as depenedent types or linear types, and they\ntry to extend the type system. For example, if you are trying to figure out the type of \n[C](https://en.wikipedia.org/wiki/The_C_Programming_Language)'s [printf](https://en.wikipedia.org/wiki/Printf_format_string), you might realise that the type of the second\nargument depends on the type of the first argument.\n\n```c\nprintf(\"%f %s\", 1.2, \"hello\")\n```\nIf you want to encode this information into the type system, then you have just discovered\ndependent types, where types depend on values. The problem of finding out if a dependently\ntyped program is valid is actually undecidable (as a subset of the [halting problem](https://en.wikipedia.org/wiki/Halting_problem)). One you say you want this, you have stepped out\nof the safety of decidable typing and you might now need to prove to the compiler\nusing a formal proof that a program typchecks, such as in languages such as [Idris](https://www.idris-lang.org/). A good documentation of this problem is on the website [typing is hard](https://3fx.ch/typing-is-hard.html).\n\nIn my view, the ideal type system of a programming language should be decidable. I don't want\nto have to write a proof that my progam is valid. The best type system for this is [Hindley-Milner](https://en.wikipedia.org/wiki/Hindley%E2%80%93Milner_type_system) which is about as far as you can creep before you plumet off the cliff of undeciability.\n\n# Presbuger Arithmetic\n\nAnother beautiful example of walking the tightrope of decidability is [Presburger Arithmetic](https://en.wikipedia.org/wiki/Presburger_arithmetic). Surprisingly, it is a formulation of arithmetic\nwhere every statement is decidable by a simple algorithm. For example, you can say \n`x+y > 10` and the Presburger algorithm will find all satisfying x and y. What is the catch?\nThere is no multiplication. Presbuger Arithmetic only has plus, equals, there exists, and for all.\nSo statements about prime factorization, for example, are impossible to state in Presburger Arithmetic. It seems that multiplcation is intricately linked with undecidability. And\nOnce we say we want multiplication, arithmetic no longer becomes decidable.\n\n# Undecidability is Interesting\n\nUnlike programmers, who would want decidabilty type systems, we mathematicians do **not**\nwant decidability in our systems. In truth, decidable systems are boring, and pose no\ninteresting mathematical questions. Due to the well-established relationship between\nexpressiveness and decidability, once we make a system expressive enough to pose\ninteresting questions, it becomes undecidable. Furthermore, in decidable systems,\ntruth is simply a matter of computation. If you want to check if a statement is \ntrue, just run a computer to check it. Mathematics in decidable systems loses\nall its beauty and elegance of unconventional proofs.  So maybe undeciability isn't so bad.\n\n# Walking off the Cliff\n\nWhat can you take away from this? Well let's say you're designing a programming tool like\na configuration language or a macro system. Users might demand more and more features, until,\nunwittingly, your simple little tool becomes undecidable. This happened to C++ templates,\nwhere now they are [turing complete](https://stackoverflow.com/questions/189172/c-templates-turing-complete) (or in other words undecidable). So my advice is to\nkeep in mind the original goal of your project and be aware of any features that\nmight cause you to wander from the island of safety that is decidability. \n\n\n","date":"April 7, 2022","tags":["automata"," decidability"," presbuger arithmetic"," type system"],"title":"The Decidability Tradeoff","slug":"decidability-tradeoff","description":"There is a fine line between power and decidability","image":"/images/automata.jpeg"},"reccomendedBlog":[{"content":"\n\n\nI recently looked at [A Talk by Bob Martin](https://www.youtube.com/watch?v=P2yr-3F6PQo) in which\nhe says that we've \"basically discovered all the programming paradigms\". He says this due to his\nview that programming paradigms are just restrictions on what programmers can do, but I disagree.\nMy view is that **a good programming language is the minimal amount needed to add to a model\nof computation**. I will explain what I mean.\n\n## Models of Computation\nAccording to Wikipedia, a [Model of Computation](https://en.wikipedia.org/wiki/Model_of_computation) is\n\"a model which describes how an output of a mathematical function is computed given an input\".\nThere are a list of models of computation on the page, which include\n- Post machines\n- Pushdown automata\n- Register machines\n- Random-access machines\n- Turing machines\n- Decision tree model\n- Abstract rewriting systems\n- Combinatory logic\n- General recursive functions\n- Lambda calculus\n- Actor model\n- Cellular automaton\n- Interaction nets\n- Kahn process networks\n- Logic gates and digital circuits\n- Petri nets\n- Synchronous Data Flow\n\nAs you can see, there are many models of computation.\n## Minimal Addition\nWhat do I mean by \"minimal additon\". Well, a model of computation only describes mathematical functions, which are pure. We would like our programs to be able to interact with the outside world. This means\nsome abilities must be added to a model of computation in order to allow interaction. The gold\nstandard for this is [Haskell](https://en.wikipedia.org/wiki/Haskell), with its monadic model of computation. In a good language, effects should be modelled using some kind of language construct, such\nas Haskell's monads, but I think the construct will vary for each model of computation.\n\n## Examples of Well-Loved Languages\n\nI will show how the best-designed languages today are simply the minimal additions to already good\nmodels of computation.\n\n\n| Model of Computation| Language|\n|--------------------|----------|\n| Untyped Lambda Calculus | Lisp|\n| Typed Lambda Calculus | Haskell|\n| Predicate Logic | Prolog |\n| Rewriting System | Wolfram |\n| Actor Model | Smalltalk |\n| Interaction Nets | [Kind2](https://github.com/Kindelia/Kind2) |\n| Combinatory Logic | APL | \n\nHopefully you see that all the languages on the right column are widely admired for being well-designed.\nAnd what unifies them all? They are all strictly based on a model of computation.\n\nLet us discuss the example of Lisp. Lisp is the [minimal wrapper](https://news.ycombinator.com/item?id=29950782) on top of the untyped lambda calculus. It does not include any features\nbeyound unleashing the inherent power of the lambda calculus. This is the main difference\nbetween Smalltalk and Java. Both are based on the [Actor Model](https://en.wikipedia.org/wiki/Actor_model)\nbut Smalltalk sticks truthfully to its model of computation, while Java confusedly\nborrows concepts from other languages.\n\n## Turing Completeness\nDue to Turing Completeness, we can say that all models of computation are equally expressive.\nSo, it remains to be decided what model we should use. I think we should first choose a model\nthat is the best for our needs.\n\n## Good Models of Computation\nGiven all these models of computation, which should we chose as a basis for our languages?\nI think it comes down to 2 critera:\n- being simple\n- having nice properties\n\nFor the first point, I think the model should be very simple. I think the [SK Calculus](https://en.wikipedia.org/wiki/SKI_combinator_calculus) is very good in this regard, and it might be the simplest model\nof computation that I have ever seen. Turing Machines, although the most well-known example of\na model of computation, are actually very complex and hard to explain. \n\nFor the second point, I mean that the model has properties that make it easy to implement and\nfast to run on our given hardware. One model that is very promising is [Interaction Nets](https://en.wikipedia.org/wiki/Interaction_nets#Properties) because they have these properties\n\n- locality (only active pairs can be rewritten)\n- linearity (each interaction rule can be applied in constant time)\n- strong confluence \n\nThese properties would make an implementation very fast, so I encourage you to try writing\nan implementation.\n\n\n## Advice to Aspiring Language Designers\nIf you want to design a language, I have some advice for how to do it. The first step is to\nchoose a model of computation that has not yet been well-explored. For example, I would\nnot design a language based on lambda calculus because that space has already been perfected\nby Lisp and Haskell, and I would not design a langauge based on predicate logic because\nProlog already does a good job there. I would choose a model that has good properties (can\nbe executed quickly on hardware) and has not been explored by any other language. Right\nnow I think the field of Linear Logic doesn't have its own industry-strength programming\nlanguage. If you think you can design such a language, I would encourage you on.\n\n\n## Summary\nIn short, a programming language is nothing but an implentation of a model of computation.","date":"Oct 10, 2022","tags":["programming"," math"," computation"," lisp"],"title":"How to Create an Excellent Programming Lanugage","slug":"create-language","description":"I have come up with a method to design well-loved languages","image":"/images/lisp.png"},{"content":"\n\nWith so many different programming languages and technologies available today, it can sometimes be confusing on which to choose for a new project. If I were given the choice, these are my top 4 favourite languages that I would use. \n\n\n\n# 4 Python\nI really like the syntax of python. The fact that it is indentation based and I don't have to deal with brackets makes the code look nice.\n\n\n# 3  PHP\nPHP is the kind of language which gets things done. I have always been interested in web development, and since PHP focuses almost exclusively on web development, I use it sometimes.\n\n\n# 2  Javascript\nAbove PHP, javascript is truly the language of the web. It is the only language to write  a full-stack application because it works on the front end and the back end.  From React to Node.js, there are many libraries, tools, and frameworks for Javascript. The extraordinary tooling makes it possible to do anything in javascript, and one will never have to switch languages if one chooses it.\n\n\n# 1  Haskell\nHaskell is my all time favourite language. It is type-safe and entirely functional. By learning Haskell, I have changed the way I think about programming. Haskell forces the programmer to learn about types and side effects in a way which no other language does. I will always try to use Haskell if I can in any context.\n","date":"April 12, 2021","tags":["python"," PHP"," javascript"," go"," java"," haskell"],"title":"My favourite Programming languages","slug":"fav-lang","description":"Programming languages are like tools, so you need the right tool for the job","image":"/images/php.png"},{"content":"\n\nComplex analysis might just be my favorite field of mathematics. It is a field steeped in\nelegance, and it makes it apparent that calculus was always supposed to be done on the complex numbers. \n\n\nYou must be stupid to think that real analysis is better than complex\nanalysis. In real analysis, functions can be not differentiable, but in complex analysis,\nif a function is once-differentiable, it is infinitely differentiable. Also, if you know\na complex function on an interval, you know it for all numbers.\n\nContour integral\n\n\n\n\n\n\n\n","date":"Jan 20, 2022","tags":["complex analysis"," math"," calculus"],"title":"Complex Analysis is Super Cool","slug":"complex-analysis","description":"it's my favorite field of mathematics","image":"/images/complex-analysis.png"}]},"__N_SSG":true}