{"pageProps":{"blog":{"content":"\nIn recent years, we've seen a lot of hype around machine learning. From [alpha go](https://deepmind.com/research/case-studies/alphago-the-story-so-far), which beat world-champion go\nplayers, to [GPT-3](https://en.wikipedia.org/wiki/GPT-3), the constant news buzz\nwould make one think we are around the corner from [AI Dominance](https://en.wikipedia.org/wiki/Technological_singularity). But I claim today that most of AI is just hype, with no\nreal substance behind it. Of course time will tell the true use of AI. In fact, most\ntimes teams eagerly throw a [neural net](https://en.wikipedia.org/wiki/Neural_network) at\na problem, they are really looking for a symbolic manipulation tool like [prolog](https://en.wikipedia.org/wiki/Prolog).\n\n# Black Boxes\n\nThe first drawback of machine learning is they are incomprehensible. If a machine learning model\nmakes a mistake, how will you figure out what went wrong? There is no real way of knowing. Sure,\nyou can look at the internal state of the model, but what does that really tell you?\nModels today are getting so large that it is impossible to hold a single one in your\nbrain. GPT-3 has [175 billion parameters](https://www.springboard.com/blog/data-science/machine-learning-gpt-3-open-ai/#:~:text=The%20largest%20version%20GPT%2D3,and%203.2%20M%20batch%20size.&text=Shown%20in%20the%20figure%20above,that%20it%20is%20quite%20larger.)\nparameters. What if it makes a mistake? Will some engineer have to go through all\n175 billion parameters just to find it? I think the true solution is [declarative](https://en.wikipedia.org/wiki/Declarative_programming) software\nthat simply states rules or definitions. That code is easier to debug and understand for\nnew users. In essence, we can only look at machine learning as a black box.\n\n# Changing Requirements\n\nOften in software engineering, projects are subject to [changing requirements](https://rebelsguidetopm.com/help-the-requirements-keep-changing-and-i-cant-nail-them-down-part-2/).\nWhat happens when this is done to a machine learning model? In short, I don't\nsee how a machine learning model trained for one task can be fixed to work on\na slightly different task. It would require a whole new retraining of the model\nevery time you want to make a change. Google even spoke about this issue in their\npaper [Machine Learning:\nThe High-Interest Credit Card of Technical Debt](https://static.googleusercontent.com/media/research.google.com/en//pubs/archive/43146.pdf). In our ever-changing world, you must truly\nconsider if you want to use a technology that requires so much effort even to change\nits purpose slightly.\n\n# Declarative Programming: is it Nirvana?\n\nI am a huge fan of declarative programming, whether from the [Wolfram Language](https://en.wikipedia.org/wiki/Wolfram_Language) or from [Prolog](https://en.wikipedia.org/wiki/Prolog).\nIn such a style, the programmer simply states the rules of the system formally, and\nthe language takes care of implementation concerns. This approach is easy to understand\nbecause it is just the rules of the system. In addition, it is easy to understand\nthe behavoir of a program: just follow which rules it applied.  If you have never\nheard of prolog, I strongly encourage you to check it out. It is unlike any other\nprogramming language, not part of the C or ALGOL lineage. It will rethink the way\nthat you understand the purpose of computers, [so try it out](https://swish.swi-prolog.org/).","date":"January 27, 2022","tags":["machine learning"," ml"," AI"],"title":"Machine Learning is overrated","slug":"machine-learning-overrated","description":"I don't understand the hype around machine learning","image":"/images/Blog-Images-Forget-Machine-Learning-Humans-Still-Have-a-Lot-to-Learn-Part-II.jpg"},"reccomendedBlog":[{"content":"\n\nThe text editor VIM is possibly one of my favourite tools for developing and coding. Whenever I have the opportunity to use vim, from VS code to Overleaf, and even google docs, I take it. I just want more people to learn and use VIM because of what an enjoyable tool is\n\n# Macros\nMany people often waste time slaving away at menial and boring text editing tasks. Vim makes relative tasks and actions easy using macros, or repeatable sets of keystrokes. \n\n\n# Speed\nIt's no doubt that with all the keybindings, getting from one location in the text to another is usually only a few keypresses. Typing is far faster than using a mouse. I have no doubt that my coding speed has increased twofold due to Vim.\n\n\n# Efficiency\nOften when I realise I have not completed the most keystroke efficient algorithm in VIM, I undo all my changes to try again. There is something immensely satisfying about executing the proper algorithm in VIM which I strive for every time I code. \n","date":"April 12, 2021","tags":["vim"],"title":"Why I love VIM","slug":"why-i-love-vim","description":"Vim is arguable the best text editor","image":"/images/vim.png"},{"content":"\n\n# My Site\nAs I have created a personal site (you're looking at it right now), I feel somewhat\nqualified to give advice to others on the best way of creating a personal site. Of course,\nif you are not impressed by my personal site, feel free not to take my advice.\n\n\nSpecifically, I think I will not give the standard or obvious advice, but rather\nI will give the advice that some people need to hear, but would rather not.\n\n# Fast and Functional\n\nThis might be a personal gripe of mine, but I would caution against using website creators\nsuch as Wix or Wordpress. They just create bloat on a site that really doesn't need it.\nWhen I go to such sites, it takes forever to load because of all the javascript bundles and\ntrackers. Really, if you can be served by plain HTML, then use plain HTML. It will give\nyour users better performance and the site will load almost instantaneously. And this\nsame advice even goes for frameworks. Do you really need your technology stack\nturning into a 100 layer wedding cake just for a personal site? Many people use their\npersonal website as an excuse to try out the latest technology. I know elm/svelte/tailwind/\nwhatever might be hot right now, but sometimes the safest option is best.\n\n# Prioritze Ease-of-Use over Flashy Animations\n\nI see some portfolio websites that look like they were created as a challenge\nto use every single animation avaible in CSS. But really, all animations do is\nslow down the user. If I have to wait 300ms for this flashy animation to complete,\nthen I feel like my flow has been interrupted on this site. I want the technology\nto get in my way as little as possible. Sure, some people take animations\nas an opportunity to show off, but if you must, put the animation in a place\nwhere it doesn't interrupt the flow of the site. Also, keep the animations small\nand less that 200ms. That way, your users will not be foaming at the mouth in\nrage at this mound of useless animations.\n\n# Create Lots of Content\n\nThis advice might seem obvious, but I think it merits repeating. Creating a wealth of\ncontent has a two-fold benefit\n\n* As you write more, you will become better at writing\n\n* By writing more, you will appear higher in search engines as more people click on\nyour site.\n\nHonestly, this is why I think starting a blog is a good idea for most personal sites. \nOf course the market is over-saturated (anyone is capable of starting a blog),\nyet you can always distinguish yourself by putting in extra efforts such as writing\nlong articles\n\n\n# Takeaway\n\nI hope I have given some unconventional advice on how to start a personal site. If\nyou want to hear more about this topic, feel free to [contact me](/contact).","date":"April 7, 2022","tags":["personal site"," html"," react"," blog"," markdown blog"],"title":"Tips for Creating a Personal Site","slug":"create-personal-site","description":"If you are thinking about creating a personal site, I have advice","image":"/images/personal-identity.jpg"},{"content":"\n\nI just recently got back from attending the [Ross Mathematics Program](https://rossprogram.org/) in Ohio and\nI would like to give a review. I came back from the airport giddy with excitement, and I wish that\nthe Ross Program could go for another week to distract me from school.\n\n## The Math\n\nOn the Ross Website, it makes it seem like you will do nothing but math for 6 weeks, and I can say that \nthe Ross Program is exactly as advertised. You will get 6 weeks of mathematics. The main curriculum in\nnumber theory was very interesting, and gave me a deeper appreciation of the integers. You may think\nthat proving that if a is divisible by b, then b < a might be a trivial task, but  at the Ross Program,\nwe go **FULL RIGOR**, meaning that every proposition must be directly from the axioms with minimal\ninference or hand waving (the student's response: \"full rigor leads to rigor mortis\"). All the problem\nsets have interesting problems that test your conceptions of numbers. \n\n## The Counsellors\nAll the counsellors at the Ross Program are excited to help you with math and discuss any math topic (Shoutout to Jon!). Just say \"I have a math problem\" and 10 heads will snap in your direction. Problem sets are\ngraded daily by the counsellors. Being in a 4-person \"family\" with a consellor creates a sense\nof camaraderie, which is good because I arrived at Ross not knowing anyone.\n\n\n## Lectures\nSpecial lectures are given by the counsellors and professors from [OSU](https://www.osu.edu/). These are\nvery exciting and you do not want to miss them. They cover eclectic topics ranging from modular forms\nto computation theory. I made the mistake of missing out on Vitaly Berglesson's Pigeonhole lecture series in\nthe first week and I regret that I did not go. The lectures introduce you to new subjects and really broadened\nmy conception of what I thought math encompassed. My favourite talk might have been Oscar's talk on the [hyper-reals](https://en.wikipedia.org/wiki/Hyperreal_number)\n\n## The Community\nThe community was my favorite thing about Ross. It is one thing to solve interesting problems, but it\nis quite another to collaborate on problems with people who are just as obsessed with math. \nWe all sort of egged each other on to solve more problems and inspired each other. I feel\nthat the biggest advantage of the Ross Program is that **it prepares you for how life will be in\nuniversity**. I.E. in university, you will likely specialize in a subject and hang out with people\nin a similar major to discuss your shared passion. \n\n## The Food\nI'd rather not dwell on this subject for too long.\n\n\n## Tips\nIf you are going to the Ross Program, I have some tips for you.\n- learn how to use a washing machine before you go\n- bring some emergency food with you\n- **pro tip:** bring a sleeping bag because the dorm beds are unsatisfactory to say the least. If you bring \na sleeping bag, you will be able to sleep.\n- In a similar vein, bring ear-plugs, because there are some people in the next dorm over\nwho say up very late and you don't want to be kept awake\n- The Ross website may claim that you shouldn't bring phones/computers/board games/cards, but \nyou will probably be fine if you bring these things.\n\n\n## Should you go to Ross?\nIf you would like to do math for 10 hours a day, for 7 days a week, for 6 weeks straight, then apply \nto the Ross Program. I was a bit intimidated at first because I had never done that much math\nbefore, but I really liked the experience. ","date":"August 28, 2022","tags":["math"," math program"," Ross"," Ross program"],"title":"A Review of the Ross Program","slug":"ross","description":"I just attended the Ross Program","image":"/images/ross-logo.svg"}]},"__N_SSG":true}