{"pageProps":{"blog":{"content":"\n\n\n# Boolean Considered Harmful\n\nI make the claim that using the boolean type (called \"Boolean\")\nis always a bad design decesion. This is because `Boolean` is\nlike the rind of an orange that has been squeezed out. The rind\ntestifies that there once was an orange here, but the juicy goodness\nof the orange is long gone.\n\nIt is the same with `Boolean`. If you are using `Boolean`, there was\nonce a function which returned more information, but this helpful information\nwas thrown away when all the information was squashed down into only 2 states.\n\nMy recommendation is that for any time you are tempted to write \"Boolean\", consider\nwhat information the function is actually computing.\n\nTo illustrate my point more, I will code the equality function on natural numbers in\n[Agda](https://en.wikipedia.org/wiki/Agda_(programming_language)). For any natural numbers `x` and `y`, `x == y` returns `true` if `x` is equal\nto `y` and false otherwise. I will then contrast this function against `x ==? y`, which I claim\nis a better function.\n\nDo not worry if you do not know [Agda](https://en.wikipedia.org/wiki/Agda_(programming_language)), because\nI will be explaining the code at every step.\n\n\n# Standard Library Functions\n\nFirst, I will defining some standard functions.\nThese functions are all in the [standard library of Agda](https://agda.github.io/agda-stdlib/),\nso this section is a learning exercise where I will be thouroughly explaining the purpose of all\nthe code.\n\n## Peano Numbers\n\nWe will represent natural numbers as [Peano Numbers](https://en.wikipedia.org/wiki/Peano_axioms), which means\nthat every natural number is either `0` or `successor(n)` for some natural number `n`. In Agda, we would\nrepresent the natural numbers as this data type:\n\n```agda\ndata NaturalNumber : Set where\n  zero : NaturalNumber\n  successor : NaturalNumber → NaturalNumber\nvariable\n  m n : NaturalNumber\n```\n## Booleans\n\nWe can then define the much-dreaded `Boolean`, which is either `true` or `false`.\n\n```agda\ndata Boolean : Set where\n  true : Boolean\n  false : Boolean\n```\n## Booleanean (Bad) Equality\n\nIn our first attempt to define equality on natural numbers, we use a `Boolean` to represent the result:\n`true` if the two numbers are equal and `false` if the two numbers are not equal.\n\n```agda\ninfixr 5 _==_\n_==_ : NaturalNumber → NaturalNumber → Boolean\nzero == zero = true\nsuccessor a == zero = false\nzero == successor b = false\nsuccessor a == successor b = a == b\n```\n\n## Propositional Equality\n\nTo begin to define our better equality, we first need a specification of equality.\nSome beginners are confused by propositional equality because propositional equality\ndoes not *compute* if two values are equal, but rather it gives the type of all *proofs*\nthat they are equal.\n\n```agda\ninfixr 5 _≡_\ndata _≡_  {A : Set o} :  A → A →  Set (lsuc o) where\n  reflexivity : {a : A} →  a ≡ a\n```\n\nSo, for example, `a ≡ b` is the type of all proofs that `a` is equal to `b`.\n\n## Empty Type\n\nThe empty type is inhabited by no values. The empty type represents the false proposition, or the proposition\nwith no proofs.\n\n```agda\ndata empty : Set where\n```\n\n## Decidability\n\nWith these pieces, we can define `decidability`. A proposition\nis [decidable](https://en.wikipedia.org/wiki/Decidability_(logic)) if there exists an\nalgorithm for deciding if the proposition is inhabited.\nThe `decides A` type will either produce evidence that `A` is inhabited, or\nproduce evidence that `A` in uninhabited.\n\n```agda\ndata decides (A : Set o) : Set o where\n  trueBecauseOf : A → decides A\n  falseBecauseOf : (A → empty) → decides A\n```\n\nA simple utility function which proves that `successor` is\nan [injective function](https://en.wikipedia.org/wiki/Injective_function).\n\n```agda\nsuccessorInjective : successor m ≡ successor n → m ≡ n\nsuccessorInjective reflexivity = reflexivity\n```\n\nGiven the type `decides`, we can say what it means for a [binary function](https://en.wikipedia.org/wiki/Binary_operation)\nto be decidable: for all its inputs, we can produce evidence of the type\nbeing inhabited or uninhabited.\n\n```agda\ndecidable2 : {A B : Set o} →  (A → B → Set ℓ) → Set (o ⊔ ℓ)\ndecidable2 {A = A} {B = B} f = (a : A) (b : B) → decides (f a b)\n```\n\n# The Improved Natural Number Equality\n\nWe will now define the improved equality function on natural numbers:\n\n```agda\ninfixr 5 _==?_\n_==?_ : decidable2 {A = NaturalNumber}  (_≡_)\nzero ==? zero = trueBecauseOf reflexivity\nzero ==? successor y = falseBecauseOf λ ()\nsuccessor x ==? zero = falseBecauseOf λ ()\nsuccessor x ==? successor y with (x ==? y)\n... | trueBecauseOf reflexivity = trueBecauseOf reflexivity\n... | falseBecauseOf x≢y = falseBecauseOf  (λ z → x≢y (successorInjective z))\n```\n\n# Why the Deciding Verison is Better\n\nYou might be wondering: \"why is `x ==? y` better than `x == y`\". In short, it is because\n`x ==? y` has a specification, but `x == y` does not.\n\nWhat's more, for all inputs, `x ==? y` returns evidence that it is correct, whereas we have not even\nstated the correctness specification for `x == y`.\n\nYou should always assume that everything is wrong until you have a formal proof that it is correct.\n\nAny function with the type signature `decidable2 {A = NaturalNumber}  (_≡_)` *must* be correct. By\nusing a more expressive type, we have ensured correctness automatically.  Others have said\n[\"make illegal states unrepresentable\"](https://fsharpforfunandprofit.com/posts/designing-with-types-making-illegal-states-unrepresentable/)\nbut I say, \"make incorrect code unwritable\".\nWrite a specification so that the only option is for your code to be correct.\n\nWith the pedestrian `x == y`, it would be easy to write a function with the same type signature that,\nin fact, would be incorrect.\n\nThe main concern in software is proofs of correctness. Every other aspect of code (including performance)\nis secondary. To learn more about this, look at [this talk](https://github.com/conal/talk-2023-galilean-revolution).\n\nFor these reasons, I strongly advise that 90% of the use of `Boolean`s is incorrect, and could be\nreplaced by more informative types.\n","date":"August 23, 2023","tags":["boolean"," denotational design"," correctness"],"title":"Boolean Considered Harmful","slug":"boolHarmful","description":"Most uses of Boolean are wrong","image":"/images/babBools.png"},"reccomendedBlog":[{"content":"\n\nComplex analysis might just be my favorite field of mathematics. It is a field steeped in\nelegance, and it makes it apparent that calculus was always supposed to be done on the complex numbers. \n\n\nYou must be stupid to think that real analysis is better than complex\nanalysis. In real analysis, functions can be not differentiable, but in complex analysis,\nif a function is once-differentiable, it is infinitely differentiable. Also, if you know\na complex function on an interval, you know it for all numbers.\n\nContour integral\n\n\n\n\n\n\n\n","date":"Jan 20, 2022","tags":["complex analysis"," math"," calculus"],"title":"Complex Analysis is Super Cool","slug":"complex-analysis","description":"it's my favorite field of mathematics","image":"/images/complex-analysis.png"},{"content":"\n\nSince haskell is a list-based language, there are many ways to work with lists. This article details some of the most interesting ways to multiply each number in a list by 5. \n1. The Imperative way\n```haskell,\nmain:: IO()\nmain = do\n  mutable <- M.replicate 256 1\n  forM_ ([1..256] z->\n    modify mutable (x->x*5) z\n   )\n```\n2. The boring way\n```haskell,\nmultiplyList :: [Int] -> [Int]\nmultiplyList xs = map (\\x->x*5) xs\n```\n3. currying\n```haskell,\nmultiplyList :: [Int] -> [Int]\nmultiplyList = map (*5) \n```\n4. monad\n```haskell,\nmultiplyList :: [Int] -> [Int]\nmultiplyList xs =  xs >>= (\\x -> [x*5])\n```\n5. short functor\n```haskell,\nm=(<$>)(*5)\n```\n6. List comprehension\n```haskell,\nmultiplyList :: [Int] -> [Int]\nmultiplyList xs = [x*5 | x <- xs]\n```\n\n\n7. Do notation\n```haskell,\nmultiplyList :: [Int] -> [Int]\nmultiplyList xs = do\n    x <- xs\n    return $ x*5\n```\n\n8. Functor\n```haskell,\nmultiplyList :: [Int] -> [Int]\nmultiplyList xs = fmap (\\x -> x*5) xs\n```\n9. Applicative\n```haskell,\nmultiplyList :: [Int] -> [Int]\nmultiplyList xs =  pure (\\x->x*5) <*> xs\n```\n10. Recursion\n```haskell,\nmultiplyList :: [Int] -> [Int]\nmultiplyList [] = []\nmultiplyList (x:xs) = (x*5) : multiplyList xs\n```\n\n\n\n\n\n","date":"May 2, 2021","tags":["haskell"," list"," map"," functor"],"title":"10 ways to map a list in haskell","slug":"10-ways-to-map-a-list","description":"Haskell is such a cool language","image":"/images/techs/haskell.png"},{"content":"\nSandeep Srinivasan is a veteran of the machine learning industry. While most have gravitated towards it since the hype of the late 2000s, Srinivasan claims he has been “interested in machine learning since the 1990s,” almost noachian in this quickly evolving field. Today, I sat down with Srinivasan in order to glean what insights he has after pioneering this industry for 30 years. \n\nI am struck by Srinivasan’s positive attitude. He himself concurs, saying its necessary to be “a lifelong learner” to succeed in this field. Even with his experience, he is “still taking courses” to learn new skills and improve himself. His optimism extends further, however. When describing how he first got into machine learning, Srinivasan said a professor was too embarrassed that no one signed up for his course in machine learning, so he paid Srinivasan $10 an hour to be the only attendant. Despite being happenstance, Srinivasan tells the story with a smile as if it is a good joke. He brings this sense of optimism to his work, summarizing that the “best part of [his] job” is to meet bright 20-year-olds who have a “beginner’s mindset” and are eager to learn. \n\nFinding these bright 20-year-olds is becoming increasingly difficult for Srinivasan, unfortunately. In this white-hot field, he must muscle his way through the likes of “Google, Facebook, Amazon, and Apple.” Due to this drive for talent, Srinivasan complains that “the hardest part” of his job is hiring for his small machine learning startup.\n\nDespite his recruiting woes, Srinivasan claims he is not deterred about founding a small machine learning startup. He says the experience has been rewarding for him. When speaking on the advantages of founding a startup, he says he gets to “eat [his] own dog food,” in the sense that he is excited to try out all the products as a consumer that he is inventing. He emphasize that a founder must act as the first customer of a product, because if the founder doesn’t believe in the product, then neither will the clients. \n\nThe main area where Srinivasan eagerly gets to try out his new inventions is with his products aiming to “simplify machine learning.” He uses his own online dashboard to set up machine learning models in a few clicks, and soon he hopes others can do the same. His mission is to “democratize machine learning for multiple applications.”  In the future, Srinivasan imagines that doctors or other domain experts could create machine learning models without coding and without technical knowledge. \n\t\nDoctors are not the only profession Srinivasan predicts machine learning will impact. He thinks that many “repetitive tasks” such as “data entry” for taxes will disappear. In addition, manual tasks, such as image labeling will be automated away by machine learning.\n\nOverall, I am very impressed with Srinivasan’s accomplishments. He certainly has the air of someone well-informed on the industry, and he was able to use his knowledge to give me personal advice for the job market (“learn statistics”). Given how he effuses knowledge in every aspect of machine learning, I would not be surprised if his startup goes far. This experience was very informative for me, and I see myself possibly having a career in machine learning. I suggest to the reader to conduct a similar informational interview, in the hopes that one could learn about an intriguing field from a personality. \n\n\n \n","date":"Feb 27, 2022","tags":["machine learning"," interview"," coding"],"title":"Interview with Machine Learning Expert","slug":"sandeep-interview","description":"After his 30 years in the field, machine learning engineer Sandeep Srinivasan offers advice on how to tackle this complex career.","image":"/images/sandeep.jpg"}]},"__N_SSG":true}