{"pageProps":{"blog":{"content":"\n\nI just recently got back from attending the [Ross Mathematics Program](https://rossprogram.org/) in Ohio and\nI would like to give a review. I came back from the airport giddy with excitement, and I wish that\nthe Ross Program could go for another week to distract me from school.\n\n## The Math\n\nOn the Ross Website, it makes it seem like you will do nothing but math for 6 weeks, and I can say that \nthe Ross Program is exactly as advertised. You will get 6 weeks of mathematics. The main curriculum in\nnumber theory was very interesting, and gave me a deeper appreciation of the integers. You may think\nthat proving that if a is divisible by b, then b < a might be a trivial task, but  at the Ross Program,\nwe go **FULL RIGOR**, meaning that every proposition must be directly from the axioms with minimal\ninference or hand waving (the student's response: \"full rigor leads to rigor mortis\"). All the problem\nsets have interesting problems that test your conceptions of numbers. \n\n## The Counsellors\nAll the counsellors at the Ross Program are excited to help you with math and discuss any math topic (Shoutout to Jon!). Just say \"I have a math problem\" and 10 heads will snap in your direction. Problem sets are\ngraded daily by the counsellors. Being in a 4-person \"family\" with a consellor creates a sense\nof camaraderie, which is good because I arrived at Ross not knowing anyone.\n\n\n## Lectures\nSpecial lectures are given by the counsellors and professors from [OSU](https://www.osu.edu/). These are\nvery exciting and you do not want to miss them. They cover eclectic topics ranging from modular forms\nto computation theory. I made the mistake of missing out on Vitaly Berglesson's Pigeonhole lecture series in\nthe first week and I regret that I did not go. The lectures introduce you to new subjects and really broadened\nmy conception of what I thought math encompassed. My favourite talk might have been Oscar's talk on the [hyper-reals](https://en.wikipedia.org/wiki/Hyperreal_number)\n\n## The Community\nThe community was my favorite thing about Ross. It is one thing to solve interesting problems, but it\nis quite another to collaborate on problems with people who are just as obsessed with math. \nWe all sort of egged each other on to solve more problems and inspired each other. I feel\nthat the biggest advantage of the Ross Program is that **it prepares you for how life will be in\nuniversity**. I.E. in university, you will likely specialize in a subject and hang out with people\nin a similar major to discuss your shared passion. \n\n## The Food\nI'd rather not dwell on this subject for too long.\n\n\n## Tips\nIf you are going to the Ross Program, I have some tips for you.\n- learn how to use a washing machine before you go\n- bring some emergency food with you\n- **pro tip:** bring a sleeping bag because the dorm beds are unsatisfactory to say the least. If you bring \na sleeping bag, you will be able to sleep.\n- In a similar vein, bring ear-plugs, because there are some people in the next dorm over\nwho say up very late and you don't want to be kept awake\n- The Ross website may claim that you shouldn't bring phones/computers/board games/cards, but \nyou will probably be fine if you bring these things.\n\n\n## Should you go to Ross?\nIf you would like to do math for 10 hours a day, for 7 days a week, for 6 weeks straight, then apply \nto the Ross Program. I was a bit intimidated at first because I had never done that much math\nbefore, but I really liked the experience. ","date":"August 28, 2022","tags":["math"," math program"," Ross"," Ross program"],"title":"A Review of the Ross Program","slug":"ross","description":"I just attended the Ross Program","image":"/images/ross-logo.svg"},"reccomendedBlog":[{"content":"\n\n\nI recently looked at [A Talk by Bob Martin](https://www.youtube.com/watch?v=P2yr-3F6PQo) in which\nhe says that we've \"basically discovered all the programming paradigms\". He says this due to his\nview that programming paradigms are just restrictions on what programmers can do, but I disagree.\nMy view is that **a good programming language is the minimal amount needed to add to a model\nof computation**. I will explain what I mean.\n\n## Models of Computation\nAccording to Wikipedia, a [Model of Computation](https://en.wikipedia.org/wiki/Model_of_computation) is\n\"a model which describes how an output of a mathematical function is computed given an input\".\nThere are a list of models of computation on the page, which include\n- Post machines\n- Pushdown automata\n- Register machines\n- Random-access machines\n- Turing machines\n- Decision tree model\n- Abstract rewriting systems\n- Combinatory logic\n- General recursive functions\n- Lambda calculus\n- Actor model\n- Cellular automaton\n- Interaction nets\n- Kahn process networks\n- Logic gates and digital circuits\n- Petri nets\n- Synchronous Data Flow\n\nAs you can see, there are many models of computation.\n## Minimal Addition\nWhat do I mean by \"minimal additon\". Well, a model of computation only describes mathematical functions, which are pure. We would like our programs to be able to interact with the outside world. This means\nsome abilities must be added to a model of computation in order to allow interaction. The gold\nstandard for this is [Haskell](https://en.wikipedia.org/wiki/Haskell), with its monadic model of computation. In a good language, effects should be modelled using some kind of language construct, such\nas Haskell's monads, but I think the construct will vary for each model of computation.\n\n## Examples of Well-Loved Languages\n\nI will show how the best-designed languages today are simply the minimal additions to already good\nmodels of computation.\n\n\n| Model of Computation| Language|\n|--------------------|----------|\n| Untyped Lambda Calculus | Lisp|\n| Typed Lambda Calculus | Haskell|\n| Predicate Logic | Prolog |\n| Rewriting System | Wolfram |\n| Actor Model | Smalltalk |\n| Interaction Nets | [Kind2](https://github.com/Kindelia/Kind2) |\n| Combinatory Logic | APL | \n\nHopefully you see that all the languages on the right column are widely admired for being well-designed.\nAnd what unifies them all? They are all strictly based on a model of computation.\n\nLet us discuss the example of Lisp. Lisp is the [minimal wrapper](https://news.ycombinator.com/item?id=29950782) on top of the untyped lambda calculus. It does not include any features\nbeyound unleashing the inherent power of the lambda calculus. This is the main difference\nbetween Smalltalk and Java. Both are based on the [Actor Model](https://en.wikipedia.org/wiki/Actor_model)\nbut Smalltalk sticks truthfully to its model of computation, while Java confusedly\nborrows concepts from other languages.\n\n## Turing Completeness\nDue to Turing Completeness, we can say that all models of computation are equally expressive.\nSo, it remains to be decided what model we should use. I think we should first choose a model\nthat is the best for our needs.\n\n## Good Models of Computation\nGiven all these models of computation, which should we chose as a basis for our languages?\nI think it comes down to 2 critera:\n- being simple\n- having nice properties\n\nFor the first point, I think the model should be very simple. I think the [SK Calculus](https://en.wikipedia.org/wiki/SKI_combinator_calculus) is very good in this regard, and it might be the simplest model\nof computation that I have ever seen. Turing Machines, although the most well-known example of\na model of computation, are actually very complex and hard to explain. \n\nFor the second point, I mean that the model has properties that make it easy to implement and\nfast to run on our given hardware. One model that is very promising is [Interaction Nets](https://en.wikipedia.org/wiki/Interaction_nets#Properties) because they have these properties\n\n- locality (only active pairs can be rewritten)\n- linearity (each interaction rule can be applied in constant time)\n- strong confluence \n\nThese properties would make an implementation very fast, so I encourage you to try writing\nan implementation.\n\n\n## Advice to Aspiring Language Designers\nIf you want to design a language, I have some advice for how to do it. The first step is to\nchoose a model of computation that has not yet been well-explored. For example, I would\nnot design a language based on lambda calculus because that space has already been perfected\nby Lisp and Haskell, and I would not design a langauge based on predicate logic because\nProlog already does a good job there. I would choose a model that has good properties (can\nbe executed quickly on hardware) and has not been explored by any other language. Right\nnow I think the field of Linear Logic doesn't have its own industry-strength programming\nlanguage. If you think you can design such a language, I would encourage you on.\n\n\n## Summary\nIn short, a programming language is nothing but an implentation of a model of computation.","date":"Oct 10, 2022","tags":["programming"," math"," computation"," lisp"],"title":"How to Create an Excellent Programming Lanugage","slug":"create-language","description":"I have come up with a method to design well-loved languages","image":"/images/lisp.png"},{"content":"\n\n# My Site\nAs I have created a personal site (you're looking at it right now), I feel somewhat\nqualified to give advice to others on the best way of creating a personal site. Of course,\nif you are not impressed by my personal site, feel free not to take my advice.\n\n\nSpecifically, I think I will not give the standard or obvious advice, but rather\nI will give the advice that some people need to hear, but would rather not.\n\n# Fast and Functional\n\nThis might be a personal gripe of mine, but I would caution against using website creators\nsuch as Wix or Wordpress. They just create bloat on a site that really doesn't need it.\nWhen I go to such sites, it takes forever to load because of all the javascript bundles and\ntrackers. Really, if you can be served by plain HTML, then use plain HTML. It will give\nyour users better performance and the site will load almost instantaneously. And this\nsame advice even goes for frameworks. Do you really need your technology stack\nturning into a 100 layer wedding cake just for a personal site? Many people use their\npersonal website as an excuse to try out the latest technology. I know elm/svelte/tailwind/\nwhatever might be hot right now, but sometimes the safest option is best.\n\n# Prioritze Ease-of-Use over Flashy Animations\n\nI see some portfolio websites that look like they were created as a challenge\nto use every single animation avaible in CSS. But really, all animations do is\nslow down the user. If I have to wait 300ms for this flashy animation to complete,\nthen I feel like my flow has been interrupted on this site. I want the technology\nto get in my way as little as possible. Sure, some people take animations\nas an opportunity to show off, but if you must, put the animation in a place\nwhere it doesn't interrupt the flow of the site. Also, keep the animations small\nand less that 200ms. That way, your users will not be foaming at the mouth in\nrage at this mound of useless animations.\n\n# Create Lots of Content\n\nThis advice might seem obvious, but I think it merits repeating. Creating a wealth of\ncontent has a two-fold benefit\n\n* As you write more, you will become better at writing\n\n* By writing more, you will appear higher in search engines as more people click on\nyour site.\n\nHonestly, this is why I think starting a blog is a good idea for most personal sites. \nOf course the market is over-saturated (anyone is capable of starting a blog),\nyet you can always distinguish yourself by putting in extra efforts such as writing\nlong articles\n\n\n# Takeaway\n\nI hope I have given some unconventional advice on how to start a personal site. If\nyou want to hear more about this topic, feel free to [contact me](/contact).","date":"April 7, 2022","tags":["personal site"," html"," react"," blog"," markdown blog"],"title":"Tips for Creating a Personal Site","slug":"create-personal-site","description":"If you are thinking about creating a personal site, I have advice","image":"/images/personal-identity.jpg"},{"content":"\n\nThe text editor VIM is possibly one of my favourite tools for developing and coding. Whenever I have the opportunity to use vim, from VS code to Overleaf, and even google docs, I take it. I just want more people to learn and use VIM because of what an enjoyable tool is\n\n# Macros\nMany people often waste time slaving away at menial and boring text editing tasks. Vim makes relative tasks and actions easy using macros, or repeatable sets of keystrokes. \n\n\n# Speed\nIt's no doubt that with all the keybindings, getting from one location in the text to another is usually only a few keypresses. Typing is far faster than using a mouse. I have no doubt that my coding speed has increased twofold due to Vim.\n\n\n# Efficiency\nOften when I realise I have not completed the most keystroke efficient algorithm in VIM, I undo all my changes to try again. There is something immensely satisfying about executing the proper algorithm in VIM which I strive for every time I code. \n","date":"April 12, 2021","tags":["vim"],"title":"Why I love VIM","slug":"why-i-love-vim","description":"Vim is arguable the best text editor","image":"/images/vim.png"}]},"__N_SSG":true}