{"pageProps":{"blog":{"content":"\n\nThe text editor VIM is possibly one of my favourite tools for developing and coding. Whenever I have the opportunity to use vim, from VS code to Overleaf, and even google docs, I take it. I just want more people to learn and use VIM because of what an enjoyable tool is\n\n# Macros\nMany people often waste time slaving away at menial and boring text editing tasks. Vim makes relative tasks and actions easy using macros, or repeatable sets of keystrokes. \n\n\n# Speed\nIt's no doubt that with all the keybindings, getting from one location in the text to another is usually only a few keypresses. Typing is far faster than using a mouse. I have no doubt that my coding speed has increased twofold due to Vim.\n\n\n# Efficiency\nOften when I realise I have not completed the most keystroke efficient algorithm in VIM, I undo all my changes to try again. There is something immensely satisfying about executing the proper algorithm in VIM which I strive for every time I code. \n","date":"April 12, 2021","tags":["vim"],"title":"Why I love VIM","slug":"why-i-love-vim","description":"Vim is arguable the best text editor","image":"/images/vim.png"},"reccomendedBlog":[{"content":"\nI have written this blog post to commemorate how my site has started today. I am especially excited as to how it turned out and I always wanted to make a personal site for myself to display my projects. I built this site using next JS and posting it on GitHub pages.I hope you take the time to look at my blog posts and projects which are on this site \n","date":"April 5, 2021","tags":["blog"," javascript"," github"],"title":"The Start of My Blog","slug":"start","description":"my first blog","image":"/images/start.jpg"},{"content":"\n\nMany people mock Javascript for being bad. Go on any programming forum and you will find countless jokes at the expense of Javascript, but I argue that many of the things people hate most about Javascript were necessary for it to survive.\nWhy is Javascript perceived as bad?\nTo see why this is the case let us first look at the most maligned aspects of Javascript. When I ask people why they hate Javascript, they will say something along the lines of \nweak typing\n\n\n# general weirdness\nI find many of the criticisms of javascript are \"why doesn't this language stop me from shooting myself in the foot\". These are certainly desirable traits, and they are certainly being remedied in modern times with strict mode in ES6 and typescript. \nThe History of Javascript \nLooking at the history of Javascript reveals why it must have been this way. It was invented by Brendan Eich in 10 days in 1995, when the web was nothing like it is today.  Just imagine how different the web is by looking at a website from 1995 and comparing it to any modern website. Eich, and indeed nobody, could have imagined how the web could have evolved, so planning for the web to change drastically was needed.\n\n# Opinionated vs Flexible\nThe core of my argument is that people want Javascript to be opinionated and strict, when, due to the complex and evolving nature of the web, it is necessary that javascript be flexible and weak. Let's say Javascript took a hard stand and became inflexible on an issue pertaining to the 90s. We today would find that anachronistic and annoying. No central authority can predict how a programming language can be used, so it's better to leave all tools available to the programmer instead of walling off some features for fear that they might be mishandled. \n","date":"May 26, 2021","tags":["javascript"," web"," web programming"],"title":"Javascript Being Bad is why it's Good","slug":"javascript-bad","description":"People malign javascript for all the wrong reasons","image":"/images/techs/javascript.png"},{"content":"\nSandeep Srinivasan is a veteran of the machine learning industry. While most have gravitated towards it since the hype of the late 2000s, Srinivasan claims he has been “interested in machine learning since the 1990s,” almost noachian in this quickly evolving field. Today, I sat down with Srinivasan in order to glean what insights he has after pioneering this industry for 30 years. \n\nI am struck by Srinivasan’s positive attitude. He himself concurs, saying its necessary to be “a lifelong learner” to succeed in this field. Even with his experience, he is “still taking courses” to learn new skills and improve himself. His optimism extends further, however. When describing how he first got into machine learning, Srinivasan said a professor was too embarrassed that no one signed up for his course in machine learning, so he paid Srinivasan $10 an hour to be the only attendant. Despite being happenstance, Srinivasan tells the story with a smile as if it is a good joke. He brings this sense of optimism to his work, summarizing that the “best part of [his] job” is to meet bright 20-year-olds who have a “beginner’s mindset” and are eager to learn. \n\nFinding these bright 20-year-olds is becoming increasingly difficult for Srinivasan, unfortunately. In this white-hot field, he must muscle his way through the likes of “Google, Facebook, Amazon, and Apple.” Due to this drive for talent, Srinivasan complains that “the hardest part” of his job is hiring for his small machine learning startup.\n\nDespite his recruiting woes, Srinivasan claims he is not deterred about founding a small machine learning startup. He says the experience has been rewarding for him. When speaking on the advantages of founding a startup, he says he gets to “eat [his] own dog food,” in the sense that he is excited to try out all the products as a consumer that he is inventing. He emphasize that a founder must act as the first customer of a product, because if the founder doesn’t believe in the product, then neither will the clients. \n\nThe main area where Srinivasan eagerly gets to try out his new inventions is with his products aiming to “simplify machine learning.” He uses his own online dashboard to set up machine learning models in a few clicks, and soon he hopes others can do the same. His mission is to “democratize machine learning for multiple applications.”  In the future, Srinivasan imagines that doctors or other domain experts could create machine learning models without coding and without technical knowledge. \n\t\nDoctors are not the only profession Srinivasan predicts machine learning will impact. He thinks that many “repetitive tasks” such as “data entry” for taxes will disappear. In addition, manual tasks, such as image labeling will be automated away by machine learning.\n\nOverall, I am very impressed with Srinivasan’s accomplishments. He certainly has the air of someone well-informed on the industry, and he was able to use his knowledge to give me personal advice for the job market (“learn statistics”). Given how he effuses knowledge in every aspect of machine learning, I would not be surprised if his startup goes far. This experience was very informative for me, and I see myself possibly having a career in machine learning. I suggest to the reader to conduct a similar informational interview, in the hopes that one could learn about an intriguing field from a personality. \n\n\n \n","date":"Feb 27, 2022","tags":["machine learning"," interview"," coding"],"title":"Interview with Machine Learning Expert","slug":"sandeep-interview","description":"After his 30 years in the field, machine learning engineer Sandeep Srinivasan offers advice on how to tackle this complex career.","image":"/images/sandeep.jpg"}]},"__N_SSG":true}