{"pageProps":{"blog":{"content":"\n\n# Linux\n\nI recently began to experiment with trying Linux, a free and open source operating system. I am a supporter\nof open-source software because I believe that it gives us true control over what we do on our electronic\ndevices. \n\n# Nixos\n\nFor my first foray into the wild world of Linux, I decided to try Nixos because I think the philosophy\nof everything being in 1 config file is pretty interesting. \n\n\n# My Experience\n\nFor the first few days, I couldn't get the X11 server to start and I was stuck in the TTY. I eventually\nfigured out that it was an issue with Intel Graphics, so I fixed it.\n\nMy experience was a bit slow and clunky starting out, but eventually, I became faster after I'd learning\nall the tricks of the new software. I actually think I am faster and more efficient now because open-source\nsoftware tends to follow the Unix Philosophy of being modular and also has lots of modes and keybindings\nto speed things up. \n\n# Software I've used\n\nThe thing I like most about free software is that it seems such software gives ultimate control and\ncustomizability to the user. Here are the software packages that I am using right now, which I believe\ngrant the user ultimate control\n\n* Nixos\n* Emacs\n* Xmonad / Xmobar\n\nI'm looking for a new terminal to use. Right now I'm using Xterm, which isn't very good. If you have any\nrecommendations of terminals that I should try, you can contact me.\n\n\n# My Configuration\n\nIf you want to see what configuration and dotfiles I'm using, go to my github because I have posted\nmy dotfiles and configuration files there. \n\n","date":"January 1, 2023","tags":["linux"," computers"," free software"],"title":"My experience using Linux","slug":"linux","description":"I recently switched to using only Linux. See how it turned out!","image":"/images/nixos.jpg"},"reccomendedBlog":[{"content":"\n\n\n# What is an RSS Feed\n\nRSS is a standard by which you may subscribe to the content of other websites, and recieve updates about the news on other websites in a \nstandardized way so that many programs can read and understand the infromation. RSS uses XML in order to communicate in a way\nthat can be easily parsed by other tools and applications.\n\n# RSS increases freedom and independence\n\nMy main promotion of RSS is a philosophical and ideological reason: RSS feeds increse freedom, independence, and decentralization on the internet.\nToo often, the web has been centralized under the lock-and-key of a few gatekeepers (to name them: Google, Meta, Apple, Microsoft).\nAt the click of their fingers, and for whatever whim, as arbitrary as they desire, your subscriptions would be deleted without\nany trace or recourse.\n\nRSS feeds put the responsability in the hands of small website owners and blogs: because the standard is so simple, anyone\ncan implement and use it without the approval of those lords of the internet.\n\n# How to Find RSS Feeds\n\nUnfortunately for my idealistic ambitions, it seems that it is rare to find RSS feeds for the websites and information that I want.\n\nWhat I usually do is open the devtools and search for \"rss\" or \"atom\" in the HTML.\n\n\n## Tools for RSS\n\nIf my techniques don't work, sometimes there are tools out there to help you get an rss feed from a website.\n\nOne example is [Kill the Newsletter!](https://kill-the-newsletter.com/), which allows you to turn an email list into an\nRSS feed.\n\n\n\n# My RSS Config\n\nFor Edifying purposes, I will share my RSS configuration for others who want to take the first step into the world of RSS.\nI use a program called [elfeed](https://github.com/skeeto/elfeed) as an RSS reader. Here is my configuration for elfeed.\n\n```emacs-lisp\n(setq elfeed-feeds\n      '(\n        (\"https://www.unison-lang.org/feed.xml\" unison programming-language)\n        (\"http://arxiv.org/rss/cs.LO\" logic)\n        (\"http://arxiv.org/rss/cs.MS\" math)\n        (\"http://arxiv.org/rss/cs.PL\" programming-language)\n        (\"http://arxiv.org/rss/math.CT\" category-theory)\n        (\"https://reddit.com/r/emacs.rss\" emacs)\n        (\"https://reddit.com/r/orgmode.rss\" emacs org-mode)\n        (\"https://reddit.com/r/nixOS.rss\" nix linux)\n        (\"https://golem.ph.utexas.edu/category/atom10.xml\" category-theory)\n        (\"https://hnrss.org/newest?points=20\")\n        (\"https://lukesmith.xyz/index.xml\")\n        (\"https://nyxt.atlas.engineer/feed\")\n        (\"https://homotopytypetheory.org/feed/\" homotopy-type-theory)\n        (\"https://math.andrej.com/feed.xml\")\n        (\"https://existentialtype.wordpress.com/feed/\" type-theory)\n        (\"https://blog.thjread.com/rss.xml\")\n        (\"https://nitter.unixfox.eu/conal/rss\")\n        (\"https://www.youtube.com/feeds/videos.xml?channel_id=UCS4FAVeYW_IaZqAbqhlvxlA\" programming-language)\n        (\"https://www.youtube.com/feeds/videos.xml?channel_id=UC1kBxkk2bcG78YBX7LMl9pQ\" programming-language)\n        (\"https://www.youtube.com/feeds/videos.xml?channel_id=UC-9jDbJ-HegCFuWuam1SfvQ\" programming-language)\n        (\"https://www.youtube.com/feeds/videos.xml?channel_id=UCFFeNyzCEQDS4KCecugmotg\" programming-language)\n        (\"https://hnrss.org/newest?q=linux&points=20\" linux)\n        (\"https://hnrss.org/newest?q=type%20theory\" type-theory)\n        (\"https://hnrss.org/newest?q=category%20theory\" category-theory)\n        (\"https://nixos.org/blog/announcements-rss.xml\" nix linux)\n        (\"https://github.com/AtticusKuhn.private.atom\")\n        (\"https://feeds.buzzsprout.com/728558.rss\" type-theory)\n        (\"https://blog.wolfram.com/feed/\" wolfram programming-language)\n        (\"https://www.google.com/alerts/feeds/04747069146194916248/458592335938245591\" type-theory)\n        (\"https://www.google.com/alerts/feeds/04747069146194916248/4667516096121066180\" category-theory)\n        (\"https://www.google.com/alerts/feeds/04747069146194916248/7476438073175009204\" homotopy-type-theory)\n        (\"https://nitter.unixfox.eu/ttforall/rss\" type-theory)\n        (\"https://nitter.unixfox.eu/typetheorypcast/rss\" type-theory)\n        (\"https://nitter.unixfox.eu/SydneyTypes/rss\" type-theory)\n        (\"https://nitter.unixfox.eu/type_theory/with_replies/rss\" type-theory)\n        (\"https://twitter.com/Jose_A_Alonso/with_replies\" math type-theory)\n        (\"https://nitter.unixfox.eu/LogicPractice/rss\" logic)\n        (\"https://www.johndcook.com/blog/feed/\")\n        (\"https://systemcrafters.net/rss/\" emacs)\n        (\"https://emacstil.com/feed.xml\" emacs)\n        (\"https://d12frosted.io/atom.xml\" emacs)\n        ))\n```\n\n# My RSS Feed\n\nNow that you are convinced of the benefits of using RSS, now would be a good time to mention that I have my own RSS feed. You can access my\nRSS feed at [/rss.xml](/rss.xml)\n","date":"August 8, 2023","tags":["RSS"," free software"],"title":"Why RSS Feeds are the Superior way to Stay Up-to-Date","slug":"rss","description":"I just started using an RSS feed","image":"/images/rss.jpg"},{"content":"\n\nMany people mock Javascript for being bad. Go on any programming forum and you will find countless jokes at the expense of Javascript, but I argue that many of the things people hate most about Javascript were necessary for it to survive.\nWhy is Javascript perceived as bad?\nTo see why this is the case let us first look at the most maligned aspects of Javascript. When I ask people why they hate Javascript, they will say something along the lines of \nweak typing\n\n\n# general weirdness\nI find many of the criticisms of javascript are \"why doesn't this language stop me from shooting myself in the foot\". These are certainly desirable traits, and they are certainly being remedied in modern times with strict mode in ES6 and typescript. \nThe History of Javascript \nLooking at the history of Javascript reveals why it must have been this way. It was invented by Brendan Eich in 10 days in 1995, when the web was nothing like it is today.  Just imagine how different the web is by looking at a website from 1995 and comparing it to any modern website. Eich, and indeed nobody, could have imagined how the web could have evolved, so planning for the web to change drastically was needed.\n\n# Opinionated vs Flexible\nThe core of my argument is that people want Javascript to be opinionated and strict, when, due to the complex and evolving nature of the web, it is necessary that javascript be flexible and weak. Let's say Javascript took a hard stand and became inflexible on an issue pertaining to the 90s. We today would find that anachronistic and annoying. No central authority can predict how a programming language can be used, so it's better to leave all tools available to the programmer instead of walling off some features for fear that they might be mishandled. \n","date":"May 26, 2021","tags":["javascript"," web"," web programming"],"title":"Javascript Being Bad is why it's Good","slug":"javascript-bad","description":"People malign javascript for all the wrong reasons","image":"/images/techs/javascript.png"},{"content":"\n\n\nI recently looked at [A Talk by Bob Martin](https://www.youtube.com/watch?v=P2yr-3F6PQo) in which\nhe says that we've \"basically discovered all the programming paradigms\". He says this due to his\nview that programming paradigms are just restrictions on what programmers can do, but I disagree.\nMy view is that **a good programming language is the minimal amount needed to add to a model\nof computation**. I will explain what I mean.\n\n## Models of Computation\nAccording to Wikipedia, a [Model of Computation](https://en.wikipedia.org/wiki/Model_of_computation) is\n\"a model which describes how an output of a mathematical function is computed given an input\".\nThere are a list of models of computation on the page, which include\n- Post machines\n- Pushdown automata\n- Register machines\n- Random-access machines\n- Turing machines\n- Decision tree model\n- Abstract rewriting systems\n- Combinatory logic\n- General recursive functions\n- Lambda calculus\n- Actor model\n- Cellular automaton\n- Interaction nets\n- Kahn process networks\n- Logic gates and digital circuits\n- Petri nets\n- Synchronous Data Flow\n\nAs you can see, there are many models of computation.\n## Minimal Addition\nWhat do I mean by \"minimal additon\". Well, a model of computation only describes mathematical functions, which are pure. We would like our programs to be able to interact with the outside world. This means\nsome abilities must be added to a model of computation in order to allow interaction. The gold\nstandard for this is [Haskell](https://en.wikipedia.org/wiki/Haskell), with its monadic model of computation. In a good language, effects should be modelled using some kind of language construct, such\nas Haskell's monads, but I think the construct will vary for each model of computation.\n\n## Examples of Well-Loved Languages\n\nI will show how the best-designed languages today are simply the minimal additions to already good\nmodels of computation.\n\n\n| Model of Computation| Language|\n|--------------------|----------|\n| Untyped Lambda Calculus | Lisp|\n| Typed Lambda Calculus | Haskell|\n| Predicate Logic | Prolog |\n| Rewriting System | Wolfram |\n| Actor Model | Smalltalk |\n| Interaction Nets | [Kind2](https://github.com/Kindelia/Kind2) |\n| Combinatory Logic | APL | \n\nHopefully you see that all the languages on the right column are widely admired for being well-designed.\nAnd what unifies them all? They are all strictly based on a model of computation.\n\nLet us discuss the example of Lisp. Lisp is the [minimal wrapper](https://news.ycombinator.com/item?id=29950782) on top of the untyped lambda calculus. It does not include any features\nbeyound unleashing the inherent power of the lambda calculus. This is the main difference\nbetween Smalltalk and Java. Both are based on the [Actor Model](https://en.wikipedia.org/wiki/Actor_model)\nbut Smalltalk sticks truthfully to its model of computation, while Java confusedly\nborrows concepts from other languages.\n\n## Turing Completeness\nDue to Turing Completeness, we can say that all models of computation are equally expressive.\nSo, it remains to be decided what model we should use. I think we should first choose a model\nthat is the best for our needs.\n\n## Good Models of Computation\nGiven all these models of computation, which should we chose as a basis for our languages?\nI think it comes down to 2 critera:\n- being simple\n- having nice properties\n\nFor the first point, I think the model should be very simple. I think the [SK Calculus](https://en.wikipedia.org/wiki/SKI_combinator_calculus) is very good in this regard, and it might be the simplest model\nof computation that I have ever seen. Turing Machines, although the most well-known example of\na model of computation, are actually very complex and hard to explain. \n\nFor the second point, I mean that the model has properties that make it easy to implement and\nfast to run on our given hardware. One model that is very promising is [Interaction Nets](https://en.wikipedia.org/wiki/Interaction_nets#Properties) because they have these properties\n\n- locality (only active pairs can be rewritten)\n- linearity (each interaction rule can be applied in constant time)\n- strong confluence \n\nThese properties would make an implementation very fast, so I encourage you to try writing\nan implementation.\n\n\n## Advice to Aspiring Language Designers\nIf you want to design a language, I have some advice for how to do it. The first step is to\nchoose a model of computation that has not yet been well-explored. For example, I would\nnot design a language based on lambda calculus because that space has already been perfected\nby Lisp and Haskell, and I would not design a langauge based on predicate logic because\nProlog already does a good job there. I would choose a model that has good properties (can\nbe executed quickly on hardware) and has not been explored by any other language. Right\nnow I think the field of Linear Logic doesn't have its own industry-strength programming\nlanguage. If you think you can design such a language, I would encourage you on.\n\n\n## Summary\nIn short, a programming language is nothing but an implentation of a model of computation.","date":"Oct 10, 2022","tags":["programming"," math"," computation"," lisp"],"title":"How to Create an Excellent Programming Lanugage","slug":"create-language","description":"I have come up with a method to design well-loved languages","image":"/images/lisp.png"}]},"__N_SSG":true}